vegeta-cli/src/vegeta/aeromant/templates/suction_hood/com/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Nine blocks: a 3 x 3 grid in x and y between the road (z = 0) and the vehicle floor (z = ZTOP). The middle
// block is the suction duct's column: its top face is the 'suction' patch; the other eight top faces are the floor.
scale   1;

vertices
(
    ({{X0}} {{Y0}} 0)
    ({{X1}} {{Y0}} 0)
    ({{X2}} {{Y0}} 0)
    ({{X3}} {{Y0}} 0)
    ({{X0}} {{Y1}} 0)
    ({{X1}} {{Y1}} 0)
    ({{X2}} {{Y1}} 0)
    ({{X3}} {{Y1}} 0)
    ({{X0}} {{Y2}} 0)
    ({{X1}} {{Y2}} 0)
    ({{X2}} {{Y2}} 0)
    ({{X3}} {{Y2}} 0)
    ({{X0}} {{Y3}} 0)
    ({{X1}} {{Y3}} 0)
    ({{X2}} {{Y3}} 0)
    ({{X3}} {{Y3}} 0)
    ({{X0}} {{Y0}} {{ZTOP}})
    ({{X1}} {{Y0}} {{ZTOP}})
    ({{X2}} {{Y0}} {{ZTOP}})
    ({{X3}} {{Y0}} {{ZTOP}})
    ({{X0}} {{Y1}} {{ZTOP}})
    ({{X1}} {{Y1}} {{ZTOP}})
    ({{X2}} {{Y1}} {{ZTOP}})
    ({{X3}} {{Y1}} {{ZTOP}})
    ({{X0}} {{Y2}} {{ZTOP}})
    ({{X1}} {{Y2}} {{ZTOP}})
    ({{X2}} {{Y2}} {{ZTOP}})
    ({{X3}} {{Y2}} {{ZTOP}})
    ({{X0}} {{Y3}} {{ZTOP}})
    ({{X1}} {{Y3}} {{ZTOP}})
    ({{X2}} {{Y3}} {{ZTOP}})
    ({{X3}} {{Y3}} {{ZTOP}})
);

blocks
(
    hex (0 1 5 4 16 17 21 20) ({{NX0}} {{NY0}} {{NZ}}) simpleGrading (1 1 1)
    hex (1 2 6 5 17 18 22 21) ({{NX1}} {{NY0}} {{NZ}}) simpleGrading (1 1 1)
    hex (2 3 7 6 18 19 23 22) ({{NX2}} {{NY0}} {{NZ}}) simpleGrading (1 1 1)
    hex (4 5 9 8 20 21 25 24) ({{NX0}} {{NY1}} {{NZ}}) simpleGrading (1 1 1)
    hex (5 6 10 9 21 22 26 25) ({{NX1}} {{NY1}} {{NZ}}) simpleGrading (1 1 1)
    hex (6 7 11 10 22 23 27 26) ({{NX2}} {{NY1}} {{NZ}}) simpleGrading (1 1 1)
    hex (8 9 13 12 24 25 29 28) ({{NX0}} {{NY2}} {{NZ}}) simpleGrading (1 1 1)
    hex (9 10 14 13 25 26 30 29) ({{NX1}} {{NY2}} {{NZ}}) simpleGrading (1 1 1)
    hex (10 11 15 14 26 27 31 30) ({{NX2}} {{NY2}} {{NZ}}) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    ground
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (4 8 9 5)
            (5 9 10 6)
            (6 10 11 7)
            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)
        );
    }
    floor
    {
        type wall;
        faces
        (
            (16 17 21 20)
            (17 18 22 21)
            (18 19 23 22)
            (20 21 25 24)
            (22 23 27 26)
            (24 25 29 28)
            (25 26 30 29)
            (26 27 31 30)
        );
    }
    suction
    {
        type patch;
        faces
        (
            (21 22 26 25)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (0 16 20 4)
            (3 7 23 19)
            (4 20 24 8)
            (7 11 27 23)
            (8 24 28 12)
            (11 15 31 27)
            (0 1 17 16)
            (12 28 29 13)
            (1 2 18 17)
            (13 29 30 14)
            (2 3 19 18)
            (14 30 31 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
